base1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;
endChannel 1.2;

vertices
(
   (0 0 0)//0
   (200 0 0)//1
   (200 50 0)//2
   (0 50 0)//3
   (0 0 1)//4
   (200 0 $endChannel)//5
   (200 50 $endChannel)//6
   (0 50 1)//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 20) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)

        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (

            (4 7 6 5)
        );
    }
    frontWall
    {
        type cyclic;
        neighbourPatch backWall;
        faces
        (
            (0 1 5 4)

        );
    }
    backWall
    {
        type cyclic;
        neighbourPatch frontWall;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
