base1/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
aveVel 1;
H 0.001;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            fixedProfile;
        profile         polynomial
        (
            ((#calc "3/2*$aveVel" 0 0)        (0 0 0))
            ((#calc "-3/2*$aveVel/pow($H,2)" 0 0)	 (2 0 0))
        );
	direction        (0 0 1);
        origin           #calc "$H"; // h0 = 1mm
    }

    outlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        #include "../runtimeC++/BJSlipCodedBC.H"

    }
    upperWall
    {
        type            symmetryPlane;
    }
    frontWall
    {
        type            cyclic;
    }
    backWall
    {
        type            cyclic;
    }
}


// ************************************************************************* //
